modify docs with the ml algo
